spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_credit_card/contains_an_error_message.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4000000000000002&card[exp_month]=4&card[exp_year]=2019&card[cvc]=314
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer sk_test_5qoCenpxXameFtfQuUF214Zw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tylers-MacBook-Pro.local 17.5.0 Darwin Kernel Version 17.5.0: Mon Mar  5 22:24:32
        PST 2018; root:xnu-4570.51.1~1/RELEASE_X86_64 x86_64 i386 MacBookPro12,1 Darwin","hostname":"Tylers-MacBook-Pro.local"}'
      Content-Length:
      - '81'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 09 Apr 2018 20:22:50 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '782'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_WzQ7xFPY0NF9s4
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1CF6VqBl5ZAm7xdluhNPyuMC",
          "object": "token",
          "card": {
            "id": "card_1CF6VpBl5ZAm7xdlGfcy2m0n",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 4,
            "exp_year": 2019,
            "fingerprint": "fgreIB3cKIQskc9w",
            "funding": "credit",
            "last4": "0002",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "108.218.251.114",
          "created": 1523305370,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Mon, 09 Apr 2018 20:22:50 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=300&currency=usd&card=tok_1CF6VqBl5ZAm7xdluhNPyuMC
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer sk_test_5qoCenpxXameFtfQuUF214Zw
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tylers-MacBook-Pro.local 17.5.0 Darwin Kernel Version 17.5.0: Mon Mar  5 22:24:32
        PST 2018; root:xnu-4570.51.1~1/RELEASE_X86_64 x86_64 i386 MacBookPro12,1 Darwin","hostname":"Tylers-MacBook-Pro.local"}'
      Content-Length:
      - '57'
      Host:
      - api.stripe.com
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Mon, 09 Apr 2018 20:22:51 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '269'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_MD7mzddTOBhAZJ
      Stripe-Version:
      - '2017-08-15'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "charge": "ch_1CF6VqBl5ZAm7xdlMA9a9qDR",
            "code": "card_declined",
            "decline_code": "generic_decline",
            "doc_url": "https://stripe.com/docs/error-codes#card-declined",
            "message": "Your card was declined.",
            "type": "card_error"
          }
        }
    http_version: 
  recorded_at: Mon, 09 Apr 2018 20:22:51 GMT
recorded_with: VCR 3.0.3
